// Auto-generated QSC checklist for Yamachan (parsed from [Yamachan] QSC JUNE)
window.YAMACHAN_QSC = {
  "sections": [
    {
      "code": "Section A",
      "name": "Cleanliness (ความสะอาด)",
      "subsections": [
        {
          "code": "A1",
          "name": "Facilities  :  สิ่งอำนวยความสะดวก",
          "groups": [
            {
              "name": "FOH  :  ภายนอกและพื้นที่ให้บริการลูกค้า",
              "items": [
                {
                  "no": 1,
                  "text": "ป้ายชื่อร้าน/อุปกรณ์ตกแต่งรอบร้าน/ ประตูหน้าร้าน/ ขอบกระจกรอบร้าน สะอาดและอยู่ในสภาพดี ไม่ชำรุด",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 2,
                  "text": "ทางเข้าร้านเป็นระเบียบ ไม่มีสิ่งกีดขวาง/ พื้นที่รอบร้านสะอาด ไม่มีขยะหรือกลิ่นรบกวน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 3,
                  "text": "ที่ตั้งเมนูหน้าร้าน/ เล่มเมนูหน้าร้าน/ สื่อการขายถูกต้องตรงรายการปัจจุบันไม่เขียนด้วยลายมือ สะอาดและอยู่ในสภาพดี ไม่ชำรุด",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 4,
                  "text": "มีสติ๊กเกอร์ เวลาเปิด-ปิดร้าน / ป้ายแนะนำ-ป้ายเตือนต่างๆ",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 5,
                  "text": "บริเวณพื้น ผนัง เพดาน ฝ้า โต๊ะ เก้าอี้ลูกค้า  เก้าอี้ (เด็ก) และเบาะนั่งลูกค้า สะอาด อยู่ในสภาพดี ไม่ชำรุด",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 6,
                  "text": "เล่มเมนูและใบแทรกได้รับการดูแลทำความสะอาดอย่างสม่ำเสมอ มีจำนวนเพียงพอ ครบถ้วนตามรายการขายปัจจุบัน และอยู่ในสภาพดีไม่ชำรุด",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 7,
                  "text": "โต๊ะลูกค้าจัดเตรียมอุปกรณ์ และเครื่องปรุงครบถ้วน สะอาด พร้อมใช้งาน (เครื่องปรุงส่วนบริการไม่หมดอายุ)",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 8,
                  "text": "ระบบไฟฟ้า (ปลั๊กไฟ, สวิตช์ไฟ,สายไฟ, ไฟส่องสว่าง,รวมถึงไฟประดับตกแต่งทุกดวง ใช้งานได้ สะอาดและอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 9,
                  "text": "เครื่องปรับอากาศส่วนบริการทำงานปกติ (หน้ากากแอร์ สะอาดและอยู่ในสภาพดี)",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 10,
                  "text": "พื้นที่บริเวณส่วนบริการอยู่ในสภาพดี มีการทำความสะอาดอย่างสม่ำเสมอในช่วงปฎิบัติงาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 11,
                  "text": "ตู้ Station เคาน์เตอร์ชั้นเก็บของและภายในลิ้นชัก มีการจัดเก็บอุปกรณ์ถาดเสิร์ฟ เรียบร้อย สะอาด อยู่ในสภาพดี /อุปกรณ์ในการทำความสะอาดโต๊ะ พร้อมใช้งาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 12,
                  "text": "อ่างล้างมือส่วนบริการ  สะอาดและอยู่ในสภาพดี มีอุปกรณ์พร้อมใช้งาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 13,
                  "text": "ห้องน้ำ สะอาดและอยู่ในสภาพดี มีอุปกรณ์พร้อมใช้งาน",
                  "weight": 1,
                  "na_default": false
                }
              ]
            },
            {
              "name": "Drink Station : บริเวณบาร์น้ำ",
              "items": [
                {
                  "no": 14,
                  "text": "ผนัง และ พื้นที่บริเวณบาร์น้ำ สะอาด พื้นแห้ง ไม่ลื่น",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 15,
                  "text": "Beer Dispenser (เครื่องจ่ายเบียร์สด) / Beer Keg (ถังเบียร์สแตนเลส) สะอาดและอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 16,
                  "text": "ชั้นวางของ และอุปกรณ์รอบบาร์น้ำสะอาด /สต็อกเครื่องดื่มจัดเป็นระเบียบ",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 17,
                  "text": "ภาชนะ แก้ว หลอด ช้อนตวง สะอาด / แก้วใส่เครื่องดื่มแอลกอฮอล์สะอาด ใส ไม่มีรอยบิ่น/แตก",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 18,
                  "text": "ตู้แช่เครื่องดื่มมีสินค้าครบ พร้อมบริการ จัดเก็บเป็นระเบียบ สะอาดและอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 19,
                  "text": "ตู้แช่น้ำแข็ง /แช่แก้วเบียร์ จัดเรียงแก้วเป็นระเบียบ  ไม่มีน้ำแข็งเกาะหนา สะอาดและอยู่ในสภาพดี (ไม่มีอาหารปะปน)",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 20,
                  "text": "บริเวณซิงค์ล้างแก้ว/ ถาดคว่ำแก้ว ได้รับการดูแลรักษาความสะอาดอย่างสม่ำเสมอ",
                  "weight": 1,
                  "na_default": false
                }
              ]
            },
            {
              "name": "Serving Station : บริเวณเตรียมเสิร์ฟ",
              "items": [
                {
                  "no": 21,
                  "text": "พื้นที่เตรียมเสิร์ฟสะอาด ไม่มีคราบอาหาร คราบน้ำ หรือสิ่งสกปรก",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 22,
                  "text": "เครื่องปรุง และเครื่องเคียงต่างๆ ที่เตรียมใช้งานบริเวณหน้าช่องส่ง  สะอาด พร้อมใช้งาน  (เครื่องปรุงส่วนบริการไม่หมดอายุ)",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 23,
                  "text": "อุปกรณ์ทานอาหารสำหรับลูกค้าทานร้าน และ นำกลับ สะอาด อยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                }
              ]
            },
            {
              "name": "BOH : ภายในพื้นที่ครัว  และ พื้นที่จัดเก็บสินค้า",
              "items": [
                {
                  "no": 24,
                  "text": "ผนัง/ กระเบื้อง/ ฝ้า/ เพดาน ในครัวสะอาด ไม่มีคราบมัน และมีการดูแลสม่ำเสมอในช่วงปฎิบัติงาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 25,
                  "text": "พื้นครัวสะอาด ไม่มีน้ำขัง และ มีการทำความสะอาดอย่างสม่ำเสมอในช่วงปฎิบัติงาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 26,
                  "text": "หลอดไฟทุกดวง, ปลั๊กไฟ, สวิตช์ไฟ พัดลมเพดาน และ เครื่องปรับอากาศทำงานปกติ (รวมถึงหน้ากากแอร์) สะอาด และอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 27,
                  "text": "บริเวณพื้นที่เก็บสินค้า / ตู้เก็บสินค้า/ ชั้นวางอุปกรณ์ เป็นระเบียบ สะอาดพร้อมใช้งานและอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 28,
                  "text": "อุปกรณ์จัดเสิร์ฟในส่วนครัว สะอาด พร้อมใช้งาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 29,
                  "text": "สเตชั่นครัว/โต๊ะเตรียมวัตถุดิบ สะอาดพร้อมใช้งานและอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 30,
                  "text": "กล่องใส่เครื่องปรุง ซอส บริเวณโต๊ะเตรียมวัตถุดิบสะอาด พร้อมใช้งานและอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 31,
                  "text": "ถังขยะสะอาด มีถุงขยะรองถัง มีฝาปิด และอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 32,
                  "text": "บริเวณซิงค์ได้รับการทำความสะอาดอย่างสม่ำเสมออยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 33,
                  "text": "บริเวณพื้นที่เก็บอุปกรณ์ทำความสะอาด จัดเก็บเป็นระเบียบ สะอาดได้รับการดูแลเป็นอย่างดี",
                  "weight": 1,
                  "na_default": false
                }
              ]
            }
          ]
        },
        {
          "code": "A2",
          "name": "Equipment : อุปกรณ์",
          "groups": [
            {
              "name": "Equipment : อุปกรณ์ และเครื่องมือต่อไปนี้สะอาดสภาพดี",
              "items": [
                {
                  "no": 1,
                  "text": "กล่องพลาสติก/ ถุงใส่วัตถุดิบต่างๆ, ภาชนะใส่วัตถุดิบ, ภาชนะปรุงอาหาร และอุปกรณ์อื่นๆ สะอาดอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 2,
                  "text": "Plastic Wrap/กล่องถุงมือ จัดเก็บเหมาะสม สะอาดอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 3,
                  "text": "มีด/ เขียง/ กรรไกร/กระทะ/ตะแกรง/กระชอน และอุปกรณ์อื่นๆ สะอาดอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 4,
                  "text": "Dishwasher/ บริเวณเครื่องล้างจานเป็นระเบียบ /ซิงค์ล้างจาน สะอาดและอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 5,
                  "text": "เตาทอดรินไน (Rinai)/เตาทอดไฟฟ้า/ เตาย่างซาลาแมนเดอร์ (Salamander) /นาฬิกาจับเวลา สะอาดและอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 6,
                  "text": "หัวเตาแก๊ส และบริเวณเตาแก็สสะอาดและอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 7,
                  "text": "บ่อดักไขมัน/ รางระบายน้ำ /ตะแกรง ได้รับการทำความสะอาดและบำรุงรักษาอย่างเหมาะสม อยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 8,
                  "text": "Hood/Filter สะอาดและอยู่ในสภาพดี ไม่มีคราบไขมันสะสม",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 9,
                  "text": "ตู้แช่เย็น เคาน์เตอร์สแตนเลส สะอาดจัดของเป็นระเบียบ และอยู่ในสภาพดี ไม่ชำรุด",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 10,
                  "text": "ตู้แช่เย็น (ตู้ยืน) สะอาดจัดของเป็นระเบียบ  และอยู่ในสภาพดี ไม่ชำรุด",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 11,
                  "text": "ตู้แช่แข็ง (ฝาทึบ) สะอาดจัดของเป็นระเบียบ และอยู่ในสภาพดี ไม่ชำรุด (ไม่มีน้ำแข็งเกาะหนา)",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 12,
                  "text": "ตู้แช่แข็ง (ตู้ยืน) สะอาดจัดของเป็นระเบียบ  และอยู่ในสภาพดี ไม่ชำรุด",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 13,
                  "text": "ไมโครเวฟ สะอาดพร้อมใช้งานและอยู่ในสภาพดี ไม่วางสิ่งของด้านบน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 14,
                  "text": "ถังดับเพลิง สะอาดอยู่ในสภาพดีพร้อมใช้งานอยู่ในจุดที่เหมาะสม",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 15,
                  "text": "เครื่องดักแมลง/ ตู้ Control/ ปลั๊กไฟ/ สายไฟ สะอาด อยู่ในสภาพดีพร้อมใช้งาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 16,
                  "text": "อุปกรณ์ชั่งน้ำหนักเที่ยงตรงและเครื่องมือการตวงผลิตภัณฑ์มีครบ สะอาดพร้อมใช้งาน อยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 17,
                  "text": "หม้อหุงข้าว/ กระติกน้ำร้อนไฟฟ้า/ หม้อทอดไร้น้ำมัน สะอาดพร้อมใช้งานและอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 18,
                  "text": "เครื่องกรองน้ำ สะอาด สภาพพร้อมใช้งานและอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 19,
                  "text": "เครื่องพิมพ์ใบออเดอร์ เปิดใช้งานครบทุก Station มีกระดาษพร้อมใช้งาน สะอาดพร้อมใช้งาน อยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 20,
                  "text": "เครื่องคิดเงิน/ เครื่องคอมพิวเตอร์/ เครื่องปริ้นเตอร์ สะอาดพร้อมใช้งาน และอยู่ในสภาพดี",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 21,
                  "text": "อุปกรณ์อื่นๆ",
                  "weight": 0,
                  "na_default": true
                }
              ]
            }
          ]
        },
        {
          "code": "A3",
          "name": "Chemical Cleaning : น้ำยาทำความสะอาด",
          "groups": [
            {
              "name": "Chemical Cleaning : น้ำยาทำความสะอาด",
              "items": [
                {
                  "no": 1,
                  "text": "มีสารเคมีและอุปกรณ์ที่เกี่ยวข้องที่อนุญาตให้ใช้ครบ  จัดเก็บอย่างเหมาะสม สะอาดอยู่ในสภาพดีพร้อมใช้งาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 2,
                  "text": "พนักงานมีความรู้เกี่ยวกับสารเคมีที่ใช้ภายในร้าน และใช้สารเคมีได้อย่างถูกต้อง",
                  "weight": 1,
                  "na_default": false
                }
              ]
            }
          ]
        },
        {
          "code": "A4",
          "name": "Pest Conrol  สัตว์พาหะ(ใส่จำนวน___ตัวที่พบ ส่วนร่องรอย ซาก มูล เป็นความสะอาด)",
          "groups": [
            {
              "name": "Pest Conrol  สัตว์พาหะ(ใส่จำนวน___ตัวที่พบ ส่วนร่องรอย ซาก มูล เป็นความสะอาด)",
              "items": [
                {
                  "no": 1,
                  "text": "หนู",
                  "weight": 0,
                  "na_default": true
                },
                {
                  "no": 2,
                  "text": "แมลงสาบ",
                  "weight": 0,
                  "na_default": true
                },
                {
                  "no": 3,
                  "text": "แมลงวัน",
                  "weight": 0,
                  "na_default": true
                },
                {
                  "no": 4,
                  "text": "มด",
                  "weight": 0,
                  "na_default": true
                },
                {
                  "no": 5,
                  "text": "ปลวก",
                  "weight": 0,
                  "na_default": true
                }
              ]
            }
          ],
          "isPestSection": true
        }
      ]
    },
    {
      "code": "Section B",
      "name": "Service (การบริการ)",
      "subsections": [
        {
          "code": "B",
          "name": "Service (การบริการ)",
          "groups": [
            {
              "name": "Service (การบริการ)",
              "items": [
                {
                  "no": 1,
                  "text": "พนักงานกล่าวต้อนรับลูกค้า ด้วยคำว่า \"อิรัสไซมัสเสะ สวัสดีค่ะ/ครับ\"  (ทักทายลูกค้าภายใน 15 วินาที)",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 2,
                  "text": "พนักงานมีการสอบถามจำนวนลูกค้า โดยกล่าวคำว่า \"คุณลูกค้ามากี่ท่านคะ/ครับ\" ก่อนนำลูกค้าไปนั่งโต๊ะที่เหมาะสม",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 3,
                  "text": "ตรวจสอบความพร้อมของเมนู วัตถุดิบ และโปรโมชั่นก่อนรับออเดอร์/หากรายการอาหารที่ลูกค้าสั่งไม่มีสินค้า ลูกค้าต้องได้รับแจ้งภายใน 3 นาที",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 4,
                  "text": "พนักงานแนะนำโปรโมชั่น เครื่องดื่ม เมนูใหม่ ให้กับลูกค้า อย่างถูกต้องและสุภาพ",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 5,
                  "text": "พนักงานรับรายการอาหาร และทวนรายการอาหาร เครื่องดื่มที่สั่ง และสอบถามความต้องการเพิ่มเติม",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 6,
                  "text": "หากลูกค้าสั่งเมนูที่ใช้เวลาในการปรุงมากกว่า15 นาที ต้องแจ้งเวลาในการเสิร์ฟให้ลูกค้าทราบก่อนเสมอ",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 7,
                  "text": "พนักงานขออนุญาตและแจ้งชื่ออาหารหรือเครื่องดื่มก่อนเสิร์ฟทุกครั้ง",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 8,
                  "text": "มีการจัดลำดับการเสิร์ฟอาหารที่ถูกต้องตามมาตรฐาน (เครื่องดื่มต้องเสิร์ฟก่อนอาหาร ภาย ในเวลา 3 นาที)",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 9,
                  "text": "มีการใช้ถาดในการเสิร์ฟและเก็บจานที่ลูกค้าทานเสร็จ อย่างถูกต้องเหมาะสม และไม่วางถาดเสิร์ฟบนโต๊ะลูกค้า",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 10,
                  "text": "พนักงานมีการสอบถามลูกค้าว่า \"คุณลูกค้าได้รับอาหารถูกต้องครบถ้วนนะคะ/ครับ\" ด้วยความสุภาพและรอยยิ้ม",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 11,
                  "text": "หากลูกค้าชูมือเรียกพนักงาน จะต้องเข้าไปสอบถามลูกค้า ภายในเวลา 1 นาที",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 12,
                  "text": "พนักงานปฎิบัติงานตามขั้นตอนการชำระเงินได้อย่างถูกต้อง",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 13,
                  "text": "พนักงานมีการเก็บโต๊ะภายใน 3 นาที หลังจากลูกค้าลุกออกจากร้าน",
                  "weight": 1,
                  "na_default": false
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "code": "Section C",
      "name": "Food Quality/ Food Safety  (คุณภาพ และความปลอดภัยอาหาร)",
      "subsections": [
        {
          "code": "C1",
          "name": "Raw Material & Preparation  : วัตถุดิบและการเตรียมวัตถุดิบ",
          "groups": [
            {
              "name": "1.1 Meat Products : วัตถุดิบประเภทเนื้อสัตว์ (เนื้อไก่,เนื้อหมู,เนื้อวัว,ไข่ไก่)",
              "items": [
                {
                  "no": 1,
                  "text": "วัตถุดิบมีลักษณะสี เนื้อสัมผัส กลิ่นถูกต้องและได้รับอนุญาตตรงตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 2,
                  "text": "วิธีการเตรียมและวิธีการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 3,
                  "text": "อายุการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐานและ หยิบวัตถุดิบใช้  FEFO, FI-FO",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 4,
                  "text": "วัตถุดิบไม่หมดอายุ พร้อมใช้ และมีจำหน่าย",
                  "weight": 1,
                  "na_default": false
                }
              ]
            },
            {
              "name": "1.2 Fish & Seafood Products : วัตถุดิบประเภทปลาและอาหารทะเล",
              "items": [
                {
                  "no": 5,
                  "text": "วัตถุดิบมีลักษณะสี เนื้อสัมผัส กลิ่นถูกต้องและได้รับอนุญาตตรงตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 6,
                  "text": "วิธีการเตรียมและวิธีการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 7,
                  "text": "อายุการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐานและ หยิบวัตถุดิบใช้  FEFO, FI-FO",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 8,
                  "text": "วัตถุดิบไม่หมดอายุ พร้อมใช้ และมีจำหน่าย",
                  "weight": 1,
                  "na_default": false
                }
              ]
            },
            {
              "name": "1.3 Semi Processed Products : วัตถุดิบกึ่งสำเร็จรูป",
              "items": [
                {
                  "no": 9,
                  "text": "วัตถุดิบมีลักษณะสี เนื้อสัมผัส กลิ่นถูกต้องและได้รับอนุญาตตรงตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 10,
                  "text": "วิธีการเตรียมและวิธีการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 11,
                  "text": "อายุการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐานและ หยิบวัตถุดิบใช้  FEFO, FI-FO",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 12,
                  "text": "วัตถุดิบไม่หมดอายุ พร้อมใช้ และมีจำหน่าย",
                  "weight": 1,
                  "na_default": false
                }
              ]
            },
            {
              "name": "1.4 Side Dish : เครื่องเคียง",
              "items": [
                {
                  "no": 13,
                  "text": "วัตถุดิบมีลักษณะสี เนื้อสัมผัส กลิ่นถูกต้องและได้รับอนุญาตตรงตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 14,
                  "text": "วิธีการเตรียมและวิธีการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 15,
                  "text": "อายุการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐานและ หยิบวัตถุดิบใช้  FEFO, FI-FO",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 16,
                  "text": "วัตถุดิบไม่หมดอายุ พร้อมใช้ และมีจำหน่าย",
                  "weight": 1,
                  "na_default": false
                }
              ]
            },
            {
              "name": "1.5 Seasoning / Dry goods/ Sauce  : วัตถุดิบประเภทเครื่องปรุงรส /ของแห้ง/ซอส",
              "items": [
                {
                  "no": 17,
                  "text": "วัตถุดิบมีลักษณะสี เนื้อสัมผัส กลิ่นถูกต้องและได้รับอนุญาตตรงตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 18,
                  "text": "วิธีการเตรียมและวิธีการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 19,
                  "text": "อายุการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐานและ หยิบวัตถุดิบใช้  FEFO, FI-FO",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 20,
                  "text": "วัตถุดิบไม่หมดอายุ พร้อมใช้ และมีจำหน่าย",
                  "weight": 1,
                  "na_default": false
                }
              ]
            },
            {
              "name": "1.6 Vegetable : วัตถุดิบประเภทผัก",
              "items": [
                {
                  "no": 21,
                  "text": "วัตถุดิบมีลักษณะสี เนื้อสัมผัส กลิ่นถูกต้องและได้รับอนุญาตตรงตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 22,
                  "text": "วิธีการเตรียมและวิธีการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 23,
                  "text": "อายุการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐานและ หยิบวัตถุดิบใช้  FEFO, FI-FO",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 24,
                  "text": "วัตถุดิบไม่หมดอายุ พร้อมใช้ และมีจำหน่าย",
                  "weight": 1,
                  "na_default": false
                }
              ]
            },
            {
              "name": "1.7 Rice / Noodle/ Cheese : วัตถุดิบประเภทข้าว/เส้น/ชีส",
              "items": [
                {
                  "no": 25,
                  "text": "วัตถุดิบมีลักษณะสี เนื้อสัมผัส กลิ่นถูกต้องและได้รับอนุญาตตรงตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 26,
                  "text": "วิธีการเตรียมและวิธีการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 27,
                  "text": "อายุการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐานและ หยิบวัตถุดิบใช้  FEFO, FI-FO",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 28,
                  "text": "วัตถุดิบไม่หมดอายุ พร้อมใช้ และมีจำหน่าย",
                  "weight": 1,
                  "na_default": false
                }
              ]
            },
            {
              "name": "1.8 Oil :  วัตถุดิบประเภทน้ำมัน",
              "items": [
                {
                  "no": 29,
                  "text": "วัตถุดิบมีลักษณะสี เนื้อสัมผัส กลิ่นถูกต้องและได้รับอนุญาตตรงตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 30,
                  "text": "วิธีการเตรียมและวิธีการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 31,
                  "text": "อายุการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐานและ หยิบวัตถุดิบใช้  FEFO, FI-FO",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 32,
                  "text": "วัตถุดิบไม่หมดอายุ พร้อมใช้ และมีจำหน่าย",
                  "weight": 1,
                  "na_default": false
                }
              ]
            },
            {
              "name": "1.9 Drinks/ Juice/ Dessert/ Milk/ Ice : เครื่องดื่ม/ น้ำผลไม้/ขนมหวาน/ นม/ น้ำแข็ง",
              "items": [
                {
                  "no": 33,
                  "text": "วัตถุดิบมีลักษณะสี เนื้อสัมผัส กลิ่นถูกต้องและได้รับอนุญาตตรงตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 34,
                  "text": "วิธีการเตรียมและวิธีการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 35,
                  "text": "อายุการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐานและ หยิบวัตถุดิบใช้  FEFO, FI-FO",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 36,
                  "text": "วัตถุดิบไม่หมดอายุ พร้อมใช้ และมีจำหน่าย",
                  "weight": 1,
                  "na_default": false
                }
              ]
            },
            {
              "name": "Other Ingredients : วัตถุดิบอื่นๆ",
              "items": [
                {
                  "no": 37,
                  "text": "วัตถุดิบมีลักษณะสี เนื้อสัมผัส กลิ่นถูกต้องและได้รับอนุญาตตรงตามมาตรฐาน",
                  "weight": 0,
                  "na_default": true
                },
                {
                  "no": 38,
                  "text": "วิธีการเตรียมและวิธีการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐาน",
                  "weight": 0,
                  "na_default": true
                },
                {
                  "no": 39,
                  "text": "อายุการเก็บรักษาวัตถุดิบถูกต้องตามมาตรฐานและ หยิบวัตถุดิบใช้  FEFO, FI-FO",
                  "weight": 0,
                  "na_default": true
                },
                {
                  "no": 40,
                  "text": "วัตถุดิบไม่หมดอายุ พร้อมใช้ และมีจำหน่าย",
                  "weight": 0,
                  "na_default": true
                }
              ],
              "naByDefault": true
            }
          ]
        },
        {
          "code": "C2",
          "name": "Product Cooking  : การปรุงผลิตภัณฑ์",
          "groups": [
            {
              "name": "2.1 Fried / Grilled Products : ผลิตภัณฑ์หมวด ทอด/ย่าง",
              "items": [
                {
                  "no": 1,
                  "text": "วิธีการเตรียมและขั้นตอนการปฏิบัติงานถูกต้อง",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 2,
                  "text": "ผลิตภัณฑ์มีลักษณะปรากฎ สี เนื้อสัมผัส และความสุกตรงตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 3,
                  "text": "วิธีการจัดจานและการบรรจุผลิตภัณฑ์ถูกต้องตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 4,
                  "text": "เสิร์ฟผลิตภัณฑ์ทันทีตามมาตรฐานกำหนด",
                  "weight": 1,
                  "na_default": false
                }
              ],
              "groupCode": "C2.1",
              "groupWeight": 5
            },
            {
              "name": "2.2 Stir Fried / Boiled / Noodle / Rice : ผลิตภัณฑ์หมวด ผัด /ต้ม / เส้น /ข้าว",
              "items": [
                {
                  "no": 5,
                  "text": "วิธีการเตรียมและขั้นตอนการปฏิบัติงานถูกต้อง",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 6,
                  "text": "ผลิตภัณฑ์มีลักษณะปรากฎ สี เนื้อสัมผัส และความสุกตรงตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 7,
                  "text": "วิธีการจัดจานและการบรรจุผลิตภัณฑ์ถูกต้องตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 8,
                  "text": "เสิร์ฟผลิตภัณฑ์ทันทีตามมาตรฐานกำหนด",
                  "weight": 1,
                  "na_default": false
                }
              ],
              "groupCode": "C2.2",
              "groupWeight": 4.25
            },
            {
              "name": "2.3 Salad / Sashimi : ผลิตภัณฑ์หมวดสลัด / ซาซิมิ",
              "items": [
                {
                  "no": 9,
                  "text": "วิธีการเตรียมและขั้นตอนการปฏิบัติงานถูกต้อง",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 10,
                  "text": "ผลิตภัณฑ์มีลักษณะปรากฎ สี เนื้อสัมผัส และความสุกตรงตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 11,
                  "text": "วิธีการจัดจานและการบรรจุผลิตภัณฑ์ถูกต้องตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 12,
                  "text": "เสิร์ฟผลิตภัณฑ์ทันทีตามมาตรฐานกำหนด",
                  "weight": 1,
                  "na_default": false
                }
              ],
              "groupCode": "C2.3",
              "groupWeight": 4
            },
            {
              "name": "2.4 Drinks/ Desserts : ผลิตภัณฑ์หมวดเครื่องดื่ม/ ขนมหวาน",
              "items": [
                {
                  "no": 13,
                  "text": "วิธีการเตรียมและขั้นตอนการปฏิบัติงานถูกต้อง",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 14,
                  "text": "ผลิตภัณฑ์มีลักษณะปรากฎ สี เนื้อสัมผัส และรสชาติตรงตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 15,
                  "text": "วิธีการจัดจานและการบรรจุผลิตภัณฑ์ถูกต้องตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 16,
                  "text": "เสิร์ฟผลิตภัณฑ์ทันทีตามมาตรฐานกำหนด",
                  "weight": 1,
                  "na_default": false
                }
              ],
              "groupCode": "C2.4",
              "groupWeight": 3.5
            },
            {
              "name": "2.5 Other Products : ผลิตภัณฑ์อื่นๆ",
              "items": [
                {
                  "no": 21,
                  "text": "วิธีการเตรียมและขั้นตอนการปฏิบัติงานถูกต้อง",
                  "weight": 0,
                  "na_default": true
                },
                {
                  "no": 22,
                  "text": "ผลิตภัณฑ์มีลักษณะปรากฎ สี เนื้อสัมผัส และรสชาติตรงตามมาตรฐาน",
                  "weight": 0,
                  "na_default": true
                },
                {
                  "no": 23,
                  "text": "วิธีการจัดจานและการบรรจุผลิตภัณฑ์ถูกต้องตามมาตรฐาน",
                  "weight": 0,
                  "na_default": true
                },
                {
                  "no": 24,
                  "text": "เสิร์ฟผลิตภัณฑ์ทันทีตามมาตรฐานกำหนด",
                  "weight": 0,
                  "na_default": true
                }
              ],
              "groupCode": "C2.5",
              "groupWeight": 1,
              "naByDefault": true
            }
          ]
        },
        {
          "code": "C3",
          "name": "Hygiene : สุขอนามัย",
          "groups": [
            {
              "name": "Hygiene : สุขอนามัย",
              "items": [
                {
                  "no": 1,
                  "text": "พนักงานปฎิบัติตามสุขอนามัยส่วนบุคคล",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 2,
                  "text": "พนักงานแต่งกายถูกต้องตามมาตรฐาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 3,
                  "text": "การจัดเก็บสัมภาระส่วนตัวและพฤติกรรมส่วนบุคคลของพนักงาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 4,
                  "text": "พนักงานปฎิบัติงานตามหลักสุขอนามัยการประกอบอาหาร ป้องกันการปนเปื้อน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 5,
                  "text": "พนักงานทุกคนไม่รับโทรศัพท์ และปิดเสียงโทรศัพท์มือถือขณะปฎิบัติงาน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 6,
                  "text": "ยารักษาโรค (ไม่หมดอายุ) จัดเก็บในพื้นที่เหมาะสม แยกจากบริเวณเตรียม ปรุงอาหาร",
                  "weight": 1,
                  "na_default": false
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "code": "Section D",
      "name": "Operation Management (การบริหารจัดการและงานเอกสาร)",
      "subsections": [
        {
          "code": "D1",
          "name": "Document : งานเอกสาร",
          "groups": [
            {
              "name": "Document : งานเอกสาร",
              "items": [
                {
                  "no": 1,
                  "text": "มีเอกสารรับรองการแจ้งจัดตั้งสถานที่จำหน่ายอาหาร, ใบทะเบียนภาษีมูลค่าเพิ่ม ภ.พ.20 ,การขออนุญาตจำหน่ายสุราและเอกสารอื่นๆ มีการปรับปรุงข้อมูลให้เป็นปัจจุบันและไม่หมดอายุ",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 2,
                  "text": "มีคู่มือปฎิบัติงานถูกต้อง ครบถ้วน สะอาด อยู่ในสภาพดีและได้รับการ Update ทั้งหมด",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 3,
                  "text": "มีรายงาน เอกสาร Prep list , Deployment, เอกสารการเช็คสต๊อค, เอกสาร Checklist เปิด - ปิด  มีการบันทึกข้อมูลทุกวัน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 4,
                  "text": "มีรายงานการตรวจ Pest control ผลการสำรวจ ติดตาม และการดำเนินการควบคุมแมลงและสัตว์พาหะนำโรคในพื้นที่ ย้อนหลัง อย่างน้อย1เดือน",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 5,
                  "text": "มีเอกสารตรวจ QSC ของผู้จัดการร้านและผู้จัดการเขต และ Actiom Plan การตรวจของ QA",
                  "weight": 1,
                  "na_default": false
                }
              ]
            }
          ]
        },
        {
          "code": "D2",
          "name": "Management : การบริหารจัดการ",
          "groups": [
            {
              "name": "Management : การบริหารจัดการ",
              "items": [
                {
                  "no": 1,
                  "text": "เปิดขายอาหารครบถ้วนตามเมนูในทุกช่องทางจำหน่าย/ ผลิตภัณฑ์และวัตถุดิบ จะต้องซื้อจากผู้จัดจำหน่ายที่บริษัทฯกำหนดเท่านั้น",
                  "weight": 1,
                  "na_default": false
                },
                {
                  "no": 2,
                  "text": "มีการแยกวัตถุดิบที่ถูกระงับใช้ รอการทำลาย หมดอายุ หรือรอคืน ออกจากวัตถุดิบมาตรฐานอย่างชัดเจน และไม่นำวัตถุดิบที่หมดอายุมาประกอบอาหารออกออเดอร์ให้ลูกค้า",
                  "weight": 1,
                  "na_default": false
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "critical": [
    {
      "no": 1,
      "text": "พบเห็นร่องรอยสัตว์ รบกวนต่างๆ"
    },
    {
      "no": 2,
      "text": "พบเห็นการปฎิบัติงาน การจัดเก็บและวางสินค้า สารเคมีหรืออุปกรณ์ต่างๆ ที่มีโอกาสเสี่ยงหรือทำให้เกิดการปนเปื้อน จากอันตรายทั้ง 3 ด้าน (กายภาพ, เคมี, ชีวภาพ)"
    },
    {
      "no": 3,
      "text": "พบเห็นการปฎิบัติงานที่ไม่ปลอดภัยหรืออันตราย ต่อพนักงานหรือลูกค้า"
    },
    {
      "no": 4,
      "text": "พบวัตถุดิบที่ไม่ได้มาตรฐานมาแปรรูปใหม่ อาจเป็นอันตรายต่อสุขภาพของลูกค้า"
    },
    {
      "no": 5,
      "text": "พบอุปกรณ์ที่แตกร้าวชำรุดและอาจก่อให้เกิดการปนเปื้อนในอาหารหรือภาชนะบรรจุ"
    }
  ]
};
